HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_bf.h
/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.BLKM */
#define IFX_SDMA_BLK_CH_CHCR_BLKM_MSK (0x7)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.BLKM */
#define IFX_SDMA_BLK_CH_CHCR_BLKM_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.CHDW */
#define IFX_SDMA_BLK_CH_CHCR_CHDW_LEN (2)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.CHDW */
#define IFX_SDMA_BLK_CH_CHCR_CHDW_MSK (0x3)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.CHDW */
#define IFX_SDMA_BLK_CH_CHCR_CHDW_OFF (21)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.CHMODE */
#define IFX_SDMA_BLK_CH_CHCR_CHMODE_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.CHMODE */
#define IFX_SDMA_BLK_CH_CHCR_CHMODE_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.CHMODE */
#define IFX_SDMA_BLK_CH_CHCR_CHMODE_OFF (20)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.DCH */
#define IFX_SDMA_BLK_CH_CHCR_DCH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.DCH */
#define IFX_SDMA_BLK_CH_CHCR_DCH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.DCH */
#define IFX_SDMA_BLK_CH_CHCR_DCH_OFF (27)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.DMAPRIO */
#define IFX_SDMA_BLK_CH_CHCR_DMAPRIO_LEN (2)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.DMAPRIO */
#define IFX_SDMA_BLK_CH_CHCR_DMAPRIO_MSK (0x3)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.DMAPRIO */
#define IFX_SDMA_BLK_CH_CHCR_DMAPRIO_OFF (30)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.ECH */
#define IFX_SDMA_BLK_CH_CHCR_ECH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.ECH */
#define IFX_SDMA_BLK_CH_CHCR_ECH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.ECH */
#define IFX_SDMA_BLK_CH_CHCR_ECH_OFF (26)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.PATSEL */
#define IFX_SDMA_BLK_CH_CHCR_PATSEL_LEN (2)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.PATSEL */
#define IFX_SDMA_BLK_CH_CHCR_PATSEL_MSK (0x3)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.PATSEL */
#define IFX_SDMA_BLK_CH_CHCR_PATSEL_OFF (24)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.PRSEL */
#define IFX_SDMA_BLK_CH_CHCR_PRSEL_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.PRSEL */
#define IFX_SDMA_BLK_CH_CHCR_PRSEL_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.PRSEL */
#define IFX_SDMA_BLK_CH_CHCR_PRSEL_OFF (28)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.RROAT */
#define IFX_SDMA_BLK_CH_CHCR_RROAT_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.RROAT */
#define IFX_SDMA_BLK_CH_CHCR_RROAT_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.RROAT */
#define IFX_SDMA_BLK_CH_CHCR_RROAT_OFF (19)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.SCH */
#define IFX_SDMA_BLK_CH_CHCR_SCH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.SCH */
#define IFX_SDMA_BLK_CH_CHCR_SCH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.SCH */
#define IFX_SDMA_BLK_CH_CHCR_SCH_OFF (29)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHCR_Bits.TREL */
#define IFX_SDMA_BLK_CH_CHCR_TREL_LEN (14)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHCR_Bits.TREL */
#define IFX_SDMA_BLK_CH_CHCR_TREL_MSK (0x3fff)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHCR_Bits.TREL */
#define IFX_SDMA_BLK_CH_CHCR_TREL_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.CICH */
#define IFX_SDMA_BLK_CH_CHICR_CICH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.CICH */
#define IFX_SDMA_BLK_CH_CHICR_CICH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.CICH */
#define IFX_SDMA_BLK_CH_CHICR_CICH_OFF (18)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.CTL */
#define IFX_SDMA_BLK_CH_CHICR_CTL_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.CTL */
#define IFX_SDMA_BLK_CH_CHICR_CTL_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.CTL */
#define IFX_SDMA_BLK_CH_CHICR_CTL_OFF (20)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.CWRP */
#define IFX_SDMA_BLK_CH_CHICR_CWRP_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.CWRP */
#define IFX_SDMA_BLK_CH_CHICR_CWRP_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.CWRP */
#define IFX_SDMA_BLK_CH_CHICR_CWRP_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.ETRL */
#define IFX_SDMA_BLK_CH_CHICR_ETRL_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.ETRL */
#define IFX_SDMA_BLK_CH_CHICR_ETRL_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.ETRL */
#define IFX_SDMA_BLK_CH_CHICR_ETRL_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.INTCT */
#define IFX_SDMA_BLK_CH_CHICR_INTCT_LEN (2)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.INTCT */
#define IFX_SDMA_BLK_CH_CHICR_INTCT_MSK (0x3)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.INTCT */
#define IFX_SDMA_BLK_CH_CHICR_INTCT_OFF (2)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.IRDV */
#define IFX_SDMA_BLK_CH_CHICR_IRDV_LEN (4)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.IRDV */
#define IFX_SDMA_BLK_CH_CHICR_IRDV_MSK (0xf)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.IRDV */
#define IFX_SDMA_BLK_CH_CHICR_IRDV_OFF (12)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPDE */
#define IFX_SDMA_BLK_CH_CHICR_WRPDE_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPDE */
#define IFX_SDMA_BLK_CH_CHICR_WRPDE_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPDE */
#define IFX_SDMA_BLK_CH_CHICR_WRPDE_OFF (1)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPSE */
#define IFX_SDMA_BLK_CH_CHICR_WRPSE_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPSE */
#define IFX_SDMA_BLK_CH_CHICR_WRPSE_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHICR_Bits.WRPSE */
#define IFX_SDMA_BLK_CH_CHICR_WRPSE_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.CH */
#define IFX_SDMA_BLK_CH_CHSR_CH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.CH */
#define IFX_SDMA_BLK_CH_CHSR_CH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.CH */
#define IFX_SDMA_BLK_CH_CHSR_CH_OFF (24)

