HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_bf.h
/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_SDMA_BLK_CH_CHSR_HTRE_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_SDMA_BLK_CH_CHSR_HTRE_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.HTRE */
#define IFX_SDMA_BLK_CH_CHSR_HTRE_OFF (25)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_SDMA_BLK_CH_CHSR_ICH_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_SDMA_BLK_CH_CHSR_ICH_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.ICH */
#define IFX_SDMA_BLK_CH_CHSR_ICH_OFF (18)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_SDMA_BLK_CH_CHSR_IPM_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_SDMA_BLK_CH_CHSR_IPM_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.IPM */
#define IFX_SDMA_BLK_CH_CHSR_IPM_OFF (19)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_SDMA_BLK_CH_CHSR_LXO_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_SDMA_BLK_CH_CHSR_LXO_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.LXO */
#define IFX_SDMA_BLK_CH_CHSR_LXO_OFF (15)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_SDMA_BLK_CH_CHSR_TCOUNT_LEN (14)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_SDMA_BLK_CH_CHSR_TCOUNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.TCOUNT */
#define IFX_SDMA_BLK_CH_CHSR_TCOUNT_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_SDMA_BLK_CH_CHSR_TRL_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_SDMA_BLK_CH_CHSR_TRL_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.TRL */
#define IFX_SDMA_BLK_CH_CHSR_TRL_OFF (20)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_SDMA_BLK_CH_CHSR_WRPD_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_SDMA_BLK_CH_CHSR_WRPD_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPD */
#define IFX_SDMA_BLK_CH_CHSR_WRPD_OFF (17)

/** \\brief  Length for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_SDMA_BLK_CH_CHSR_WRPS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_SDMA_BLK_CH_CHSR_WRPS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_CHSR_Bits.WRPS */
#define IFX_SDMA_BLK_CH_CHSR_WRPS_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_CH_DADR_Bits.DADR */
#define IFX_SDMA_BLK_CH_DADR_DADR_LEN (32)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_DADR_Bits.DADR */
#define IFX_SDMA_BLK_CH_DADR_DADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_DADR_Bits.DADR */
#define IFX_SDMA_BLK_CH_DADR_DADR_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CH_SADR_Bits.SADR */
#define IFX_SDMA_BLK_CH_SADR_SADR_LEN (32)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_SADR_Bits.SADR */
#define IFX_SDMA_BLK_CH_SADR_SADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_SADR_Bits.SADR */
#define IFX_SDMA_BLK_CH_SADR_SADR_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_SDMA_BLK_CH_SHADR_SHADR_LEN (32)

/** \\brief  Mask for Ifx_SDMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_SDMA_BLK_CH_SHADR_SHADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SDMA_BLK_CH_SHADR_Bits.SHADR */
#define IFX_SDMA_BLK_CH_SHADR_SHADR_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_SDMA_BLK_CHINTR0_SIT0_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_SDMA_BLK_CHINTR0_SIT0_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT0 */
#define IFX_SDMA_BLK_CHINTR0_SIT0_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_SDMA_BLK_CHINTR0_SIT1_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_SDMA_BLK_CHINTR0_SIT1_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT1 */
#define IFX_SDMA_BLK_CHINTR0_SIT1_OFF (1)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_SDMA_BLK_CHINTR0_SIT2_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_SDMA_BLK_CHINTR0_SIT2_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT2 */
#define IFX_SDMA_BLK_CHINTR0_SIT2_OFF (2)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_SDMA_BLK_CHINTR0_SIT3_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_SDMA_BLK_CHINTR0_SIT3_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT3 */
#define IFX_SDMA_BLK_CHINTR0_SIT3_OFF (3)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_SDMA_BLK_CHINTR0_SIT4_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_SDMA_BLK_CHINTR0_SIT4_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT4 */
#define IFX_SDMA_BLK_CHINTR0_SIT4_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_SDMA_BLK_CHINTR0_SIT5_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_SDMA_BLK_CHINTR0_SIT5_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT5 */
#define IFX_SDMA_BLK_CHINTR0_SIT5_OFF (5)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_SDMA_BLK_CHINTR0_SIT6_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_SDMA_BLK_CHINTR0_SIT6_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT6 */
#define IFX_SDMA_BLK_CHINTR0_SIT6_OFF (6)

/** \\brief  Length for Ifx_SDMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_SDMA_BLK_CHINTR0_SIT7_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_SDMA_BLK_CHINTR0_SIT7_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHINTR0_Bits.SIT7 */
#define IFX_SDMA_BLK_CHINTR0_SIT7_OFF (7)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_SDMA_BLK_CHRSTR0_CH0_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_SDMA_BLK_CHRSTR0_CH0_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH0 */
#define IFX_SDMA_BLK_CHRSTR0_CH0_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_SDMA_BLK_CHRSTR0_CH1_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_SDMA_BLK_CHRSTR0_CH1_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH1 */
#define IFX_SDMA_BLK_CHRSTR0_CH1_OFF (1)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_SDMA_BLK_CHRSTR0_CH2_LEN (1)

