HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_bf.h
/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_SDMA_BLK_CHRSTR0_CH2_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH2 */
#define IFX_SDMA_BLK_CHRSTR0_CH2_OFF (2)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_SDMA_BLK_CHRSTR0_CH3_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_SDMA_BLK_CHRSTR0_CH3_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH3 */
#define IFX_SDMA_BLK_CHRSTR0_CH3_OFF (3)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_SDMA_BLK_CHRSTR0_CH4_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_SDMA_BLK_CHRSTR0_CH4_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH4 */
#define IFX_SDMA_BLK_CHRSTR0_CH4_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_SDMA_BLK_CHRSTR0_CH5_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_SDMA_BLK_CHRSTR0_CH5_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH5 */
#define IFX_SDMA_BLK_CHRSTR0_CH5_OFF (5)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_SDMA_BLK_CHRSTR0_CH6_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_SDMA_BLK_CHRSTR0_CH6_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH6 */
#define IFX_SDMA_BLK_CHRSTR0_CH6_OFF (6)

/** \\brief  Length for Ifx_SDMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_SDMA_BLK_CHRSTR0_CH7_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_SDMA_BLK_CHRSTR0_CH7_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CHRSTR0_Bits.CH7 */
#define IFX_SDMA_BLK_CHRSTR0_CH7_OFF (7)

/** \\brief  Length for Ifx_SDMA_BLK_CLRE_Bits.CFPIER */
#define IFX_SDMA_BLK_CLRE_CFPIER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CLRE_Bits.CFPIER */
#define IFX_SDMA_BLK_CLRE_CFPIER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CLRE_Bits.CFPIER */
#define IFX_SDMA_BLK_CLRE_CFPIER_OFF (20)

/** \\brief  Length for Ifx_SDMA_BLK_CLRE_Bits.CMExDER */
#define IFX_SDMA_BLK_CLRE_CMEXDER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CLRE_Bits.CMExDER */
#define IFX_SDMA_BLK_CLRE_CMEXDER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CLRE_Bits.CMExDER */
#define IFX_SDMA_BLK_CLRE_CMEXDER_OFF (17)

/** \\brief  Length for Ifx_SDMA_BLK_CLRE_Bits.CMExSER */
#define IFX_SDMA_BLK_CLRE_CMEXSER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CLRE_Bits.CMExSER */
#define IFX_SDMA_BLK_CLRE_CMEXSER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CLRE_Bits.CMExSER */
#define IFX_SDMA_BLK_CLRE_CMEXSER_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_CLRE_Bits.CPERER */
#define IFX_SDMA_BLK_CLRE_CPERER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CLRE_Bits.CPERER */
#define IFX_SDMA_BLK_CLRE_CPERER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CLRE_Bits.CPERER */
#define IFX_SDMA_BLK_CLRE_CPERER_OFF (22)

/** \\brief  Length for Ifx_SDMA_BLK_CLRE_Bits.CSRIER */
#define IFX_SDMA_BLK_CLRE_CSRIER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_CLRE_Bits.CSRIER */
#define IFX_SDMA_BLK_CLRE_CSRIER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_CLRE_Bits.CSRIER */
#define IFX_SDMA_BLK_CLRE_CSRIER_OFF (21)

/** \\brief  Length for Ifx_SDMA_BLK_EER_Bits.EDER */
#define IFX_SDMA_BLK_EER_EDER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_EER_Bits.EDER */
#define IFX_SDMA_BLK_EER_EDER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_EER_Bits.EDER */
#define IFX_SDMA_BLK_EER_EDER_OFF (17)

/** \\brief  Length for Ifx_SDMA_BLK_EER_Bits.ESER */
#define IFX_SDMA_BLK_EER_ESER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_EER_Bits.ESER */
#define IFX_SDMA_BLK_EER_ESER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_EER_Bits.ESER */
#define IFX_SDMA_BLK_EER_ESER_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.DER */
#define IFX_SDMA_BLK_ERRSR_DER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.DER */
#define IFX_SDMA_BLK_ERRSR_DER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.DER */
#define IFX_SDMA_BLK_ERRSR_DER_OFF (17)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.FPIER */
#define IFX_SDMA_BLK_ERRSR_FPIER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.FPIER */
#define IFX_SDMA_BLK_ERRSR_FPIER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.FPIER */
#define IFX_SDMA_BLK_ERRSR_FPIER_OFF (20)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.LEC */
#define IFX_SDMA_BLK_ERRSR_LEC_LEN (6)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.LEC */
#define IFX_SDMA_BLK_ERRSR_LEC_MSK (0x3f)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.LEC */
#define IFX_SDMA_BLK_ERRSR_LEC_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.PERER */
#define IFX_SDMA_BLK_ERRSR_PERER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.PERER */
#define IFX_SDMA_BLK_ERRSR_PERER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.PERER */
#define IFX_SDMA_BLK_ERRSR_PERER_OFF (22)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.SER */
#define IFX_SDMA_BLK_ERRSR_SER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.SER */
#define IFX_SDMA_BLK_ERRSR_SER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.SER */
#define IFX_SDMA_BLK_ERRSR_SER_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_ERRSR_Bits.SRIER */
#define IFX_SDMA_BLK_ERRSR_SRIER_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ERRSR_Bits.SRIER */
#define IFX_SDMA_BLK_ERRSR_SRIER_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ERRSR_Bits.SRIER */
#define IFX_SDMA_BLK_ERRSR_SRIER_OFF (21)

/** \\brief  Length for Ifx_SDMA_BLK_ME_INTR_Bits.SIT */
#define IFX_SDMA_BLK_ME_INTR_SIT_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_INTR_Bits.SIT */
#define IFX_SDMA_BLK_ME_INTR_SIT_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_INTR_Bits.SIT */
#define IFX_SDMA_BLK_ME_INTR_SIT_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_SDMA_BLK_ME_PR_PAT00_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_SDMA_BLK_ME_PR_PAT00_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_PR_Bits.PAT00 */
#define IFX_SDMA_BLK_ME_PR_PAT00_OFF (0)

