HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_bf.h
/** \\brief  Length for Ifx_SDMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_SDMA_BLK_ME_PR_PAT01_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_SDMA_BLK_ME_PR_PAT01_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_PR_Bits.PAT01 */
#define IFX_SDMA_BLK_ME_PR_PAT01_OFF (8)

/** \\brief  Length for Ifx_SDMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_SDMA_BLK_ME_PR_PAT02_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_SDMA_BLK_ME_PR_PAT02_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_PR_Bits.PAT02 */
#define IFX_SDMA_BLK_ME_PR_PAT02_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_SDMA_BLK_ME_PR_PAT03_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_SDMA_BLK_ME_PR_PAT03_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_PR_Bits.PAT03 */
#define IFX_SDMA_BLK_ME_PR_PAT03_OFF (24)

/** \\brief  Length for Ifx_SDMA_BLK_ME_R_Bits.RD00 */
#define IFX_SDMA_BLK_ME_R_RD00_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_R_Bits.RD00 */
#define IFX_SDMA_BLK_ME_R_RD00_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_R_Bits.RD00 */
#define IFX_SDMA_BLK_ME_R_RD00_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_ME_R_Bits.RD01 */
#define IFX_SDMA_BLK_ME_R_RD01_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_R_Bits.RD01 */
#define IFX_SDMA_BLK_ME_R_RD01_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_R_Bits.RD01 */
#define IFX_SDMA_BLK_ME_R_RD01_OFF (8)

/** \\brief  Length for Ifx_SDMA_BLK_ME_R_Bits.RD02 */
#define IFX_SDMA_BLK_ME_R_RD02_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_R_Bits.RD02 */
#define IFX_SDMA_BLK_ME_R_RD02_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_R_Bits.RD02 */
#define IFX_SDMA_BLK_ME_R_RD02_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_ME_R_Bits.RD03 */
#define IFX_SDMA_BLK_ME_R_RD03_LEN (8)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_R_Bits.RD03 */
#define IFX_SDMA_BLK_ME_R_RD03_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_R_Bits.RD03 */
#define IFX_SDMA_BLK_ME_R_RD03_OFF (24)

/** \\brief  Length for Ifx_SDMA_BLK_ME_SR_Bits.CH */
#define IFX_SDMA_BLK_ME_SR_CH_LEN (6)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_SR_Bits.CH */
#define IFX_SDMA_BLK_ME_SR_CH_MSK (0x3f)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_SR_Bits.CH */
#define IFX_SDMA_BLK_ME_SR_CH_OFF (16)

/** \\brief  Length for Ifx_SDMA_BLK_ME_SR_Bits.RS */
#define IFX_SDMA_BLK_ME_SR_RS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_SR_Bits.RS */
#define IFX_SDMA_BLK_ME_SR_RS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_SR_Bits.RS */
#define IFX_SDMA_BLK_ME_SR_RS_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_ME_SR_Bits.WS */
#define IFX_SDMA_BLK_ME_SR_WS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_ME_SR_Bits.WS */
#define IFX_SDMA_BLK_ME_SR_WS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_ME_SR_Bits.WS */
#define IFX_SDMA_BLK_ME_SR_WS_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC0_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC0_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC0 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC0_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC1_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC1_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC1 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC1_OFF (1)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC2_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC2_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC2 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC2_OFF (2)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC3_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC3_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC3 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC3_OFF (3)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC4_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC4_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC4 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC4_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC5_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC5_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC5 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC5_OFF (5)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC6_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC6_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC6 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC6_OFF (6)

/** \\brief  Length for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC7_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC7_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSACR0_Bits.SUSAC7 */
#define IFX_SDMA_BLK_SUSACR0_SUSAC7_OFF (7)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN0_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN0_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN0 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN0_OFF (0)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN1_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN1_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN1 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN1_OFF (1)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN2_LEN (1)

