HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSdma_bf.h
/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN2_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN2 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN2_OFF (2)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN3_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN3_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN3 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN3_OFF (3)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN4_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN4_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN4 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN4_OFF (4)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN5_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN5_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN5 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN5_OFF (5)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN6_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN6_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN6 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN6_OFF (6)

/** \\brief  Length for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN7_LEN (1)

/** \\brief  Mask for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN7_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_BLK_SUSENR0_Bits.SUSEN7 */
#define IFX_SDMA_BLK_SUSENR0_SUSEN7_OFF (7)

/** \\brief  Length for Ifx_SDMA_CLC0_Bits.DISR */
#define IFX_SDMA_CLC0_DISR_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC0_Bits.DISR */
#define IFX_SDMA_CLC0_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC0_Bits.DISR */
#define IFX_SDMA_CLC0_DISR_OFF (0)

/** \\brief  Length for Ifx_SDMA_CLC0_Bits.DISS */
#define IFX_SDMA_CLC0_DISS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC0_Bits.DISS */
#define IFX_SDMA_CLC0_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC0_Bits.DISS */
#define IFX_SDMA_CLC0_DISS_OFF (1)

/** \\brief  Length for Ifx_SDMA_CLC0_Bits.EDIS */
#define IFX_SDMA_CLC0_EDIS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC0_Bits.EDIS */
#define IFX_SDMA_CLC0_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC0_Bits.EDIS */
#define IFX_SDMA_CLC0_EDIS_OFF (3)

/** \\brief  Length for Ifx_SDMA_CLC1_Bits.DISR */
#define IFX_SDMA_CLC1_DISR_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC1_Bits.DISR */
#define IFX_SDMA_CLC1_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC1_Bits.DISR */
#define IFX_SDMA_CLC1_DISR_OFF (0)

/** \\brief  Length for Ifx_SDMA_CLC1_Bits.DISS */
#define IFX_SDMA_CLC1_DISS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC1_Bits.DISS */
#define IFX_SDMA_CLC1_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC1_Bits.DISS */
#define IFX_SDMA_CLC1_DISS_OFF (1)

/** \\brief  Length for Ifx_SDMA_CLC1_Bits.EDIS */
#define IFX_SDMA_CLC1_EDIS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_CLC1_Bits.EDIS */
#define IFX_SDMA_CLC1_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_CLC1_Bits.EDIS */
#define IFX_SDMA_CLC1_EDIS_OFF (3)

/** \\brief  Length for Ifx_SDMA_CRCCH_RD_Bits.RDCRC */
#define IFX_SDMA_CRCCH_RD_RDCRC_LEN (32)

/** \\brief  Mask for Ifx_SDMA_CRCCH_RD_Bits.RDCRC */
#define IFX_SDMA_CRCCH_RD_RDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SDMA_CRCCH_RD_Bits.RDCRC */
#define IFX_SDMA_CRCCH_RD_RDCRC_OFF (0)

/** \\brief  Length for Ifx_SDMA_CRCCH_SD_Bits.SDCRC */
#define IFX_SDMA_CRCCH_SD_SDCRC_LEN (32)

/** \\brief  Mask for Ifx_SDMA_CRCCH_SD_Bits.SDCRC */
#define IFX_SDMA_CRCCH_SD_SDCRC_MSK (0xffffffff)

/** \\brief  Offset for Ifx_SDMA_CRCCH_SD_Bits.SDCRC */
#define IFX_SDMA_CRCCH_SD_SDCRC_OFF (0)

/** \\brief  Length for Ifx_SDMA_ID_Bits.MODNUMBER */
#define IFX_SDMA_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_SDMA_ID_Bits.MODNUMBER */
#define IFX_SDMA_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_SDMA_ID_Bits.MODNUMBER */
#define IFX_SDMA_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_SDMA_ID_Bits.MODREV */
#define IFX_SDMA_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_SDMA_ID_Bits.MODREV */
#define IFX_SDMA_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_ID_Bits.MODREV */
#define IFX_SDMA_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_SDMA_ID_Bits.MODTYPE */
#define IFX_SDMA_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_SDMA_ID_Bits.MODTYPE */
#define IFX_SDMA_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_SDMA_ID_Bits.MODTYPE */
#define IFX_SDMA_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_SDMA_OTSS_Bits.BS */
#define IFX_SDMA_OTSS_BS_LEN (1)

/** \\brief  Mask for Ifx_SDMA_OTSS_Bits.BS */
#define IFX_SDMA_OTSS_BS_MSK (0x1)

/** \\brief  Offset for Ifx_SDMA_OTSS_Bits.BS */
#define IFX_SDMA_OTSS_BS_OFF (7)

/** \\brief  Length for Ifx_SDMA_OTSS_Bits.TGS */
#define IFX_SDMA_OTSS_TGS_LEN (4)

/** \\brief  Mask for Ifx_SDMA_OTSS_Bits.TGS */
#define IFX_SDMA_OTSS_TGS_MSK (0xf)

/** \\brief  Offset for Ifx_SDMA_OTSS_Bits.TGS */
#define IFX_SDMA_OTSS_TGS_OFF (0)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSDMA_BF_H */
